{
    "ul": [
        "VisitApplyGiveMenuVisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefinedSJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSUSearch×search",
        "A-Z IndexAnnual Security Report [pdf]BookstoreCalendarsCareers and JobsCatalogCurrent StudentsEmergency Food & HousingFaculty & StaffFreedom of SpeechKing LibraryNewsCenterParenting StudentsParking and Maps",
        "VisitToggle menuCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsToggle menuColleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing LibraryAdmissionsToggle menuTuition and FeesHousingProfessional EducationInternational StudentsParents and Family ProgramsCampus LifeToggle menuHealth and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni ConnectionResearch and InnovationToggle menuOffice of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and InstitutesAthleticsSJSU OnlineAboutToggle menuAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
        "VisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
        "One Washington SquareSan José, CA 95192408-924-1000SJSU Online",
        "Health and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnection",
        "Tuition and FeesHousingProfessional EducationInternational StudentsParents and Family Programs",
        "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024",
        "Campus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJ",
        "Health and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni Connection",
        "AccessibilityAccreditationTitle IXDiversityLand AcknowledgementPrivacy",
        "BusinessEducationEngineeringGraduate StudiesHealth and Human SciencesHumanities and the ArtsProfessional EducationScienceSocial Sciences",
        "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
        "Office of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand Institutes",
        "Administrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
        "SJSU on FacebookSJSU on TwitterSJSU on LinkedInSJSU on InstagramSJSU on YouTube",
        "SJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSU",
        "Tuition and FeesHousingProfessional EducationInternational StudentsParent andFamily Programs",
        "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
        "Contact FormDirectoryDoing Business with SJSUEmergency InfoFile a ComplaintReport a Title IX Complaint",
        "Colleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing Library",
        "Office of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and Institutes",
        "Filters:AllInstagramTwitterFacebookTikTokYouTubeLinkedIn",
        "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
        "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
        "Colleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing Library"
    ],
    "class:j-stack": [
        "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
        "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
        "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
        "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
        "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024"
    ],
    "class:galcolumn": [
        "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
        "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
        "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
        "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
        "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024"
    ],
    "id:j-column-0": "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
    "id:j-column-1": "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024",
    "id:j-column-2": "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
    "id:j-column-3": "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
    "id:j-column-4": "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
    "nested_pages": {
        "https://www.sjsu.edu#maincontent": {
            "ul": [
                "VisitApplyGiveMenuVisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefinedSJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSUSearch×search",
                "A-Z IndexAnnual Security Report [pdf]BookstoreCalendarsCareers and JobsCatalogCurrent StudentsEmergency Food & HousingFaculty & StaffFreedom of SpeechKing LibraryNewsCenterParenting StudentsParking and Maps",
                "VisitToggle menuCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsToggle menuColleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing LibraryAdmissionsToggle menuTuition and FeesHousingProfessional EducationInternational StudentsParents and Family ProgramsCampus LifeToggle menuHealth and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni ConnectionResearch and InnovationToggle menuOffice of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and InstitutesAthleticsSJSU OnlineAboutToggle menuAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "VisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "One Washington SquareSan José, CA 95192408-924-1000SJSU Online",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnection",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParents and Family Programs",
                "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024",
                "Campus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJ",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni Connection",
                "AccessibilityAccreditationTitle IXDiversityLand AcknowledgementPrivacy",
                "BusinessEducationEngineeringGraduate StudiesHealth and Human SciencesHumanities and the ArtsProfessional EducationScienceSocial Sciences",
                "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand Institutes",
                "Administrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "SJSU on FacebookSJSU on TwitterSJSU on LinkedInSJSU on InstagramSJSU on YouTube",
                "SJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSU",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParent andFamily Programs",
                "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
                "Contact FormDirectoryDoing Business with SJSUEmergency InfoFile a ComplaintReport a Title IX Complaint",
                "Colleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing Library",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and Institutes",
                "Filters:AllInstagramTwitterFacebookTikTokYouTubeLinkedIn",
                "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
                "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
                "Colleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing Library"
            ],
            "class:j-stack": [
                "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
                "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
                "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
                "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
                "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024"
            ],
            "class:galcolumn": [
                "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
                "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
                "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
                "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
                "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024"
            ],
            "id:j-column-0": "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
            "id:j-column-1": "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024",
            "id:j-column-2": "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
            "id:j-column-3": "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
            "id:j-column-4": "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter."
        },
        "https://www.sjsu.edu/": {
            "ul": [
                "VisitApplyGiveMenuVisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefinedSJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSUSearch×search",
                "A-Z IndexAnnual Security Report [pdf]BookstoreCalendarsCareers and JobsCatalogCurrent StudentsEmergency Food & HousingFaculty & StaffFreedom of SpeechKing LibraryNewsCenterParenting StudentsParking and Maps",
                "VisitToggle menuCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsToggle menuColleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing LibraryAdmissionsToggle menuTuition and FeesHousingProfessional EducationInternational StudentsParents and Family ProgramsCampus LifeToggle menuHealth and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni ConnectionResearch and InnovationToggle menuOffice of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and InstitutesAthleticsSJSU OnlineAboutToggle menuAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "VisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "One Washington SquareSan José, CA 95192408-924-1000SJSU Online",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnection",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParents and Family Programs",
                "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024",
                "Campus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJ",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni Connection",
                "AccessibilityAccreditationTitle IXDiversityLand AcknowledgementPrivacy",
                "BusinessEducationEngineeringGraduate StudiesHealth and Human SciencesHumanities and the ArtsProfessional EducationScienceSocial Sciences",
                "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand Institutes",
                "Administrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "SJSU on FacebookSJSU on TwitterSJSU on LinkedInSJSU on InstagramSJSU on YouTube",
                "SJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSU",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParent andFamily Programs",
                "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
                "Contact FormDirectoryDoing Business with SJSUEmergency InfoFile a ComplaintReport a Title IX Complaint",
                "Colleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing Library",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and Institutes",
                "Filters:AllInstagramTwitterFacebookTikTokYouTubeLinkedIn",
                "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
                "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
                "Colleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing Library"
            ],
            "class:j-stack": [
                "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
                "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
                "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
                "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
                "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024"
            ],
            "class:galcolumn": [
                "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter.",
                "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
                "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
                "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
                "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024"
            ],
            "id:j-column-0": "sjsu21hJoin your A.S. Student Government for new monthly Town Hall sessions to engage, share ideas and make a difference at SJSU.📅 First Town Hall: Wednesday, October 30th, 10 AM - 12 PM in SU Meeting Room 2. 📅Topics include:⏰ CSU Time, Place, & Manner Policy💵Rising Total Cost of Attendance📢How A.S. Can Advocate for YouAS wants to hear your thoughts! For questions, contact Ariana Lacson, A.S. President atas-president@sjsu.edu.#SpartanUp #SJSU #AdvocacyPreviousNextsjsu4d🎉We’re thrilled to announce that Bob Regan received this year’s William Randolph Hearst Award from the SJSU School of Journalism and Mass Communications @jmcspartans! 🙌As the founder of Operation Song, Bob has made a significant impact on the lives of countless veterans by helping them share their stories through music. He joins an impressive lineup of past honorees including Jim Acosta, Sara Sidner and Dan Rather.Since launching in 2012, Operation Song has created 1,815 songs and served more than 2,600 veterans and their families. Bob’s work weaves together songwriting and storytelling, transforming lives along the way. He even received recognition from President Biden at the White House last year!Congratulations to Bob Regan on this well-deserved honor! We can’t wait to celebrate your incredible contributions! 🎶✨#HearstAward #SJSU #OperationSong #VeteranSupport #MusicMatterssjsu6dIt’s been 35 years since the Loma Prieta earthquake hit the Bay Area on October 17, 1989, but Linda Smith D’Ambrosio, ‘92 Public Relations, will never forget the moment the earthquake struck.She was watching a baseball game in her dorm. “We were staring at the TV waiting for the opening ceremony, and all of a sudden the television went to ash,” she remembers. “And then we felt the shaking and it was so violent we could barely stand on our feet. I ran to the doorway of our dormitory and just held on.”Learn more about D’Ambrosio’s experience and how you can prepare yourself and your loved ones for future earthquakes on the #SJSUNewsCenter.",
            "id:j-column-1": "sjsu46hThe US Space Command, a government agency responsible for delivering space capabilities to joint and combined forces and protecting and defending the space domain, has officially welcomed San José State University (SJSU) to its Academic Engagement Enterprise (AEE).\"San José State University and the Charles W. Davidson College of Engineering have a long tradition of teaching and research in aeronautical engineering, and later aerospace engineering. With the increase in US commercial and defense-related activities in space and the launch of the United States Space Force, we are excited to join the AEE,” says Sheryl Ehrman, dean of engineering. \"Our participation in the AEE will boost our student and faculty capacity to contribute to advancing our nation's interests in this area.\"Michael Kaufman, dean of the College of Science, adds, \"The SJSU College of Science prides itself on providing basic and applied research opportunities to students across our disciplines so that they gain skills that can be used to address some of the nation's biggest challenges. These skills, including advanced computing, machine learning, applied mathematics, and remote sensing align well with the needs of the United States Space Force. This partnership will ensure that College of Science faculty and students can fully contribute to addressing those challenges.”For more on what this new enterprise will mean for SJSU, check out the article on the SJSU #NewsCenter.PreviousNextsjsu5dEarlier this week, a vibrant gathering took place at the @sjsulibrary as we celebrated Smith and Carlos Day with a breakfast reception for our student-athletes. Dr. Tommie Smith @tommiesmith68 joined the event as the honored guest, engaging with the athletes and sharing his profound insights. This moment not only honored the legacy of two iconic figures but also inspired a new generation to carry that legacy forward.It was a morning to remember, leaving us feeling inspired and motivated as we honor those who paved the way for us! 🥇 #SJSUAthletes#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDay #Legacy #OnTheirShouldersPreviousNextsjsu7d🎉 What an incredible day at the 6th Annual Block Party celebrating Sammy the Spartan’s 100th Birthday! 🎈 Thanks to everyone who joined us for delicious shaved ice, tacos and all the fun activities throughout 7th Street Plaza.It was a fantastic time filled with laughter and celebration! Here’s to many more amazing memories together. 🥳🍧🌮#SJSUPride #SJSULife #SammyTurns100 #BlockParty2024",
            "id:j-column-2": "PreviousNextsjsu47hLast Thursday, San José State University’s Associated Students brought the 17th annual Fire on the Fountain to life at Tower Lawn! The fire dancers lit up the night, the flames reflecting the vibrant spirit of our community.Everything seemed pretty \"Lit!\" 💙💛#FireOnTheFountain #SJSU #Homecoming #SpartanPridePreviousNextsjsu5d📣 Exciting news, Spartans! 🎉Join us for the 2024 William Randolph Hearst Award ceremony honoring Bob Regan for \"Outstanding Professional Journalism\" on Thursday, October 17, from 4:30 to 6:30 PM at the Martin Luther King Jr. Library, Room 225.Bob is the founder of Operation Song, a nonprofit that connects songwriters with veterans and active duty military to share their stories through music. This award celebrates accomplished journalists and inspires future media professionals.Everyone is welcome to join the celebration! We hope to see you there! 🎶✨If you cannot physically be there do not fret - copy and paste the link below to join our Live Stream:https://sjsu.zoom.us/j/86967440886?pwd=e7ET92wLXPdvqQhNublJLNWbGJdZzC.1#SJSUPride #HearstAward #JournalismExcellence #Inspirationsjsu7dAs Andrew Jenkins, ’21 Political Science, ’23 MS Justice Studies, ’24 MS Interdisciplinary Studies, states, “San José has a lot of knowledge and a lot of people who want to change the world, and at San José State, we preach and pride ourselves on being the pioneers of change.”Explore the latest issue of #SJSUWSQ magazine for more on how SJSU will effect this change. As we close the first century of Spartans, we look to the next, profiling alumni like Mychal Threets, a proponent of library joy; celebrating the opening of brand-new, state-of-the-art student housing; and examining the incredible patents and inventions created by SJSU faculty and alumni who will help shape the future.Read more about our past, present and future Spartans in the latest #SJSUWSQ.",
            "id:j-column-3": "PreviousNextsjsu2d“I prepared a speech five days ago and now that’s out the window,\" said Tommie Smith, '69 Social Science, '05 Honorary Doctorate, last week at SJSU. \"I want to be with you, beside you! Faith is what I have in our future, which is a substance for things to hope for; it becomes evidence for things not seen. You might not have it, but you have the knowledge to achieve it. Continue to do more and leave things for the next generation!”Reflecting on Smith and Carlos Day at Smith and Carlos Lawn! A big shout out to the incredible Dr. Tommie Smith for his inspiration. Thank you to the César E. Chávez Community Action Center for all your hard work in making this day truly special! Let’s keep pushing forward for the next generation! 💪✨#SmithAndCarlosDay #SJSU #CommunityActionPreviousNextsjsu6dYesterday, on the 56th anniversary of one of the most impactful moments in Olympic history, SJSU had the privilege of hosting a remarkable Fireside chat with Dr. Tommie Smith @tommiesmith68 in honor of Smith and Carlos Day. As an Olympic Gold medalist, Dr. Smith shared invaluable insights from his extraordinary journey.“I’ve lost two races in my life, and both were to John Carlos! But you know what? He can outrun me! I see a bit of him in each of you looking out at this room at all of you students.”Thank you to everyone who made the day possible. It will be one to remember for SJSU.#TommieSmith #Inspiration #SJSUPride #SmithAndCarlosDaysjsu8dExciting news, future Spartans! Join us for our open house by registering for Fall Preview Day at SJSU on Saturday, November 2! We can’t wait to show you around our campus, share what our academic programs have to offer, and help you connect with different departments. A special shoutout to @futurespartans for working diligently to welcome our next generation of Spartans!Copy and Paste the link to find out more:https://www.sjsu.edu/admissions/preview-day/index.php.We hope to see you there!#FallPreviewDay #SJSU #FutureSpartans",
            "id:j-column-4": "sjsu4d“The Day of the Dead is certainly a time to remember and reflect, but it's also a time to recall the joy in life,” says Kathryn Blackmer Reyes, ’96 MLIS, director of the Africana, Asian American, Chicano, and Native American (AAACNA) Studies Center at King Library. She has coordinated the annual Art of Remembrance in honor of Día de los Muertos at the library for more than 15 years.“Mourning our loved ones is difficult, but it also allows us to give thanks by giving them our time, however long that might be,” she adds. “And sometimes all it takes is five minutes. With this exhibit, I hope people enjoy the art, the presentation, the conversation that the artists/creators are presenting, and also the conversation they might have with others.”Read more about upcoming festivities, including the 27th annual Día de los Muertos procession and festival on Oct. 20, on the SJSU NewsCenter blog.PreviousNextsjsu6d🌟 What a fantastic evening with Bryan Ford @artisanbryan! He truly brought the art of baking to life, beautifully describing his blend of Latin American traditions with artisanal sourdough techniques.Listening to his journey, professional insights, and genuine connection with the audience was both entertaining and inspiring. The sneak peeks from Bryan's upcoming book, Pan y Dulce—“a love letter to Latin America,” as he describes it—had everyone buzzing with excitement.A big thank you to those who joined us for the Latinx Heritage Month Featured Speaker event in the Student Union Ballroom, especially @CENTRO_SJSU and @thebloc_sjsu for making it happen! It was a night filled with delicious stories and vibrant conversation. Here’s to many more memorable events like this! 🍞✨#SJSU #BryanFord #SJSULikesBakedGoods #LatinxHeritageMonthsjsu8dSJSU recently hosted U.S. Secretary of Health and Human Services (HHS) Xavier Becerra, who toured campus alongside President Cynthia Teniente-Matson and other campus leaders, as well as Society of Latino Engineers and Scientists (SOLES) President Antonio Hueso-Fernandez, ‘25 Mechanical Engineering, and CSU Student Trustee and CSU Channel Islands student Jazmin Guajardo.Hueso-Fernandez found the secretary’s visit to be “a truly impactful moment, not just for me but for my family as well. In less than two generations, our family's journey has gone from working in agricultural fields to introducing Secretary Becerra during Hispanic Heritage Month and soon graduating from SJSU's College of Engineering with a degree in Mechanical Engineering. I want him to know that while SJSU has made incredible strides in increasing the number of Hispanic and Latino students in STEM, there is still much work to be done.”For this and more student perspectives, as well as details about the new ARPA-H Emerging Health Innovators (EHI) Initiative, read the story on our NewsCenter."
        },
        "https://www.sjsu.edu/visit/index.php": {
            "ul": [
                "A-Z IndexAnnual Security Report [pdf]BookstoreCalendarsCareers and JobsCatalogCurrent StudentsEmergency Food & HousingFaculty & StaffFreedom of SpeechKing LibraryNewsCenterParenting StudentsParking and Maps",
                "VisitToggle menuCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsToggle menuColleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing LibraryAdmissionsToggle menuTuition and FeesHousingProfessional EducationInternational StudentsParents and Family ProgramsCampus LifeToggle menuHealth and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni ConnectionResearch and InnovationToggle menuOffice of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and InstitutesAthleticsSJSU OnlineAboutToggle menuAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "VisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnection",
                "One Washington SquareSan José, CA 95192408-924-1000SJSU Online",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParents and Family Programs",
                "Campus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJ",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni Connection",
                "AccessibilityAccreditationTitle IXDiversityLand AcknowledgementPrivacy",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand Institutes",
                "Administrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "MenuVisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefinedSJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSUSearch×search",
                "SJSU on FacebookSJSU on TwitterSJSU on LinkedInSJSU on InstagramSJSU on YouTube",
                "SJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSU",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParent andFamily Programs",
                "BusinessEducationEngineeringGraduate StudiesHealth and Human SciencesHumanities and the ArtsProfessional EducationScienceSocial Science",
                "Contact FormDirectoryDoing Business with SJSUEmergency InfoFile a ComplaintReport a Title IX Complaint",
                "Colleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing Library",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and Institutes",
                "Colleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing Library",
                "Last Updated Jul 25, 2024"
            ],
            "class:j-stack": [],
            "class:galcolumn": []
        },
        "https://www.sjsu.edu/admissions/index.php": {
            "ul": [
                "SJSU Fall Preview DayCollege PresentationsWorkshopsSpartan BookstoreEvent ParkingSpartan Eats DiningVideo Library",
                "Admission RequirementsCSU Eligibility RequirementsEnglish Proficiency Requirement",
                "Have AppliedInternational Transfer ApplicantActivate MySJSUWriting Skills TestSubmitting Documents",
                "A-Z IndexAnnual Security Report [pdf]BookstoreCalendarsCareers and JobsCatalogCurrent StudentsEmergency Food & HousingFaculty & StaffFreedom of SpeechKing LibraryNewsCenterParenting StudentsParking and Maps",
                "VisitToggle menuCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsToggle menuColleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing LibraryAdmissionsToggle menuTuition and FeesHousingProfessional EducationInternational StudentsParents and Family ProgramsCampus LifeToggle menuHealth and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni ConnectionResearch and InnovationToggle menuOffice of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and InstitutesAthleticsSJSU OnlineAboutToggle menuAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "VisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "Been AdmittedTransfer Steps to EnrollmentTransfer Intent to EnrollRegister for ClassesTransfer Test Requirements",
                "Colleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing Library",
                "One Washington SquareSan José, CA 95192408-924-1000SJSU Online",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnection",
                "Want to ApplyDomestic Steps to AdmissionToggle menuDomestic Steps to AdmissionGraduate California ResidencyInternational Steps to AdmissionToggle menuInternational Steps to Admission3-year Bachelors Degree",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParents and Family Programs",
                "TransferAdmission RequirementsToggle menuAdmission RequirementsCSU Eligibility RequirementsCoursework Outside the U.S.Want to ApplyToggle menuWant to ApplyApply to SJSUTransfer Steps to AdmissionTransfer Success PathwaySupplemental ApplicationAssociate DegreeFormer StudentSuccess ProgramsSpring AdmissionHave AppliedToggle menuHave AppliedTransfer ApplicantActivate MySJSUWriting Skills TestSubmitting DocumentsBeen AdmittedToggle menuBeen AdmittedTransfer Steps to EnrollmentTransfer Intent to EnrollRegister for ClassesTransfer Test RequirementsDeadlines",
                "Campus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJ",
                "Degree ProgramsAdmission RequirementsDeadlinesWant to ApplyHave AppliedBeen Admitted",
                "International FreshmanAdmission RequirementsToggle menuAdmission RequirementsCSU Eligibility RequirementsEnglish Proficiency RequirementWant to ApplyToggle menuWant to ApplyInternational Freshman Steps to AdmissionInternational Support ProgramsDocuments RequiredHave AppliedToggle menuHave AppliedInternational Freshman ApplicantActivate MySJSUSubmitting DocumentsBeen AdmittedToggle menuBeen AdmittedInternational Freshman Steps to EnrollmentInternational Freshman Intent to EnrollRegister for ClassesInternational Freshman Test RequirementsDeadlines",
                "Been AdmittedDomestic Steps to EnrollmentInternational Steps to EnrollmentToggle menuInternational Steps to EnrollmentTransferring an I-20Changing Your Academic LevelCampus ResourcesDeferral InformationMandatory Intent to Enroll",
                "Want to ApplyApply to SJSUInternational Transfer Steps to AdmissionSupplemental ApplicationAssociate DegreeInternational Support ProgramsDocuments RequiredFormer StudentSpring Admission",
                "Admission RequirementsWant to ApplyHave AppliedBeen AdmittedDeadlines",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni Connection",
                "Assessment ReportsUniversity Learning Outcomes",
                "Undergraduate AppealAppeal SubmittedAppeal Submitted",
                "Want to ApplyInternational Freshman Steps to AdmissionInternational Support ProgramsDocuments Required",
                "International TransferAdmission RequirementsToggle menuAdmission RequirementsCSU Eligibility RequirementsEnglish Proficiency RequirementWant to ApplyToggle menuWant to ApplyApply to SJSUInternational Transfer Steps to AdmissionSupplemental ApplicationAssociate DegreeInternational Support ProgramsDocuments RequiredFormer StudentSpring AdmissionHave AppliedToggle menuHave AppliedInternational Transfer ApplicantActivate MySJSUWriting Skills TestSubmitting DocumentsBeen AdmittedToggle menuBeen AdmittedInternational Transfer Steps to EnrollmentInternational Transfer Intent to EnrollRegister for ClassesInternational Transfer Test RequirementsDeadlines",
                "Undergraduate Application StatusGraduate Application StatusUndergraduate AppealResidency Resources",
                "About UsAssessment ReportsUniversity Learning Outcomes",
                "ArchiveFall 2021Spring 2021Fall 2020Spring 2020Fall 2019Spring 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012",
                "Freshmen Impaction ResultsTransfer Impaction ResultsPrograms with Supplemental CriteriaSupplemental Application for Transfer",
                "DeadlinesDomestic DeadlinesInternational Deadlines",
                "AccessibilityAccreditationTitle IXDiversityLand AcknowledgementPrivacy",
                "Appeal ProcessGraduate Appeal Submission",
                "Want to ApplyApply to SJSUFreshman Steps to AdmissionSuccess Programs",
                "Admissions RequirementsWant to ApplyHave AppliedBeen AdmittedDeadlines",
                "GraduateDegree ProgramsAdmission RequirementsToggle menuAdmission RequirementsSJSU RequirementsDegree Program RequirementsTest RequirementsDeadlinesToggle menuDeadlinesDomestic DeadlinesInternational DeadlinesWant to ApplyToggle menuWant to ApplyDomestic Steps to AdmissionToggle menuDomestic Steps to AdmissionGraduate California ResidencyInternational Steps to AdmissionToggle menuInternational Steps to Admission3-year Bachelors DegreeHave AppliedToggle menuHave AppliedActivate MySJSUApplication Document SubmittedConnect With UsStatement of Purpose SubmittedBeen AdmittedToggle menuBeen AdmittedDomestic Steps to EnrollmentInternational Steps to EnrollmentToggle menuInternational Steps to EnrollmentTransferring an I-20Changing Your Academic LevelCampus ResourcesDeferral InformationMandatory Intent to Enroll",
                "Have AppliedActivate MySJSUApplication Document SubmittedConnect With UsStatement of Purpose Submitted",
                "ArchiveFall 2021Spring 2021Fall 2020Fall 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012",
                "Admissions RequirementsCSU EligibilityCoursework Outside the U.S.",
                "Been AdmittedInternational Freshman Steps to EnrollmentInternational Freshman Intent to EnrollRegister for ClassesInternational Freshman Test Requirements",
                "Been AdmittedInternational Transfer Steps to EnrollmentInternational Transfer Intent to EnrollRegister for ClassesInternational Transfer Test Requirements",
                "ImpactionFreshmen Impaction ResultsToggle menuFreshmen Impaction ResultsFall 2023Fall 2022EI for College of Engineering Programs - FreshmenArchiveToggle menuArchiveFall 2021Spring 2021Fall 2020Fall 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012Transfer Impaction ResultsToggle menuTransfer Impaction ResultsFall 2024Spring 2024Fall 2023Spring 2023Fall 2022Spring 2022ArchiveToggle menuArchiveFall 2021Spring 2021Fall 2020Spring 2020Fall 2019Spring 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012Programs with Supplemental CriteriaToggle menuPrograms with Supplemental CriteriaTransfer Impaction Criteria - Associate Degree forTransfer Impaction Criteria - Program Specific CouSupplemental Application for TransferToggle menuSupplemental Application for TransferSupplemental Application Help Guide",
                "Supplemental Application for TransferSupplemental Application Help Guide",
                "FreshmanAdmissions RequirementsToggle menuAdmissions RequirementsCSU EligibilityCoursework Outside the U.S.Want to ApplyToggle menuWant to ApplyApply to SJSUFreshman Steps to AdmissionSuccess ProgramsHave AppliedToggle menuHave AppliedFreshman ApplicantActivate MySJSUBeen AdmittedToggle menuBeen AdmittedFreshman Steps to EnrollmentFreshman Intent to EnrollRegister for ClassesFreshman Test RequirementsEarly StartDeadlines",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand Institutes",
                "Administrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "College PresentationsWorkshopsSpartan BookstoreEvent ParkingSpartan Eats DiningVideo Library",
                "MenuVisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefinedSJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSUSearch×search",
                "Have AppliedInternational Freshman ApplicantActivate MySJSUSubmitting Documents",
                "Freshmen Impaction ResultsFall 2023Fall 2022EI for College of Engineering Programs - FreshmenArchiveToggle menuArchiveFall 2021Spring 2021Fall 2020Fall 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012",
                "Why SJSU?FreshmanToggle menuFreshmanAdmissions RequirementsToggle menuAdmissions RequirementsCSU EligibilityCoursework Outside the U.S.Want to ApplyToggle menuWant to ApplyApply to SJSUFreshman Steps to AdmissionSuccess ProgramsHave AppliedToggle menuHave AppliedFreshman ApplicantActivate MySJSUBeen AdmittedToggle menuBeen AdmittedFreshman Steps to EnrollmentFreshman Intent to EnrollRegister for ClassesFreshman Test RequirementsEarly StartDeadlinesTransferToggle menuTransferAdmission RequirementsToggle menuAdmission RequirementsCSU Eligibility RequirementsCoursework Outside the U.S.Want to ApplyToggle menuWant to ApplyApply to SJSUTransfer Steps to AdmissionTransfer Success PathwaySupplemental ApplicationAssociate DegreeFormer StudentSuccess ProgramsSpring AdmissionHave AppliedToggle menuHave AppliedTransfer ApplicantActivate MySJSUWriting Skills TestSubmitting DocumentsBeen AdmittedToggle menuBeen AdmittedTransfer Steps to EnrollmentTransfer Intent to EnrollRegister for ClassesTransfer Test RequirementsDeadlinesInternational FreshmanToggle menuInternational FreshmanAdmission RequirementsToggle menuAdmission RequirementsCSU Eligibility RequirementsEnglish Proficiency RequirementWant to ApplyToggle menuWant to ApplyInternational Freshman Steps to AdmissionInternational Support ProgramsDocuments RequiredHave AppliedToggle menuHave AppliedInternational Freshman ApplicantActivate MySJSUSubmitting DocumentsBeen AdmittedToggle menuBeen AdmittedInternational Freshman Steps to EnrollmentInternational Freshman Intent to EnrollRegister for ClassesInternational Freshman Test RequirementsDeadlinesInternational TransferToggle menuInternational TransferAdmission RequirementsToggle menuAdmission RequirementsCSU Eligibility RequirementsEnglish Proficiency RequirementWant to ApplyToggle menuWant to ApplyApply to SJSUInternational Transfer Steps to AdmissionSupplemental ApplicationAssociate DegreeInternational Support ProgramsDocuments RequiredFormer StudentSpring AdmissionHave AppliedToggle menuHave AppliedInternational Transfer ApplicantActivate MySJSUWriting Skills TestSubmitting DocumentsBeen AdmittedToggle menuBeen AdmittedInternational Transfer Steps to EnrollmentInternational Transfer Intent to EnrollRegister for ClassesInternational Transfer Test RequirementsDeadlinesGraduateToggle menuGraduateDegree ProgramsAdmission RequirementsToggle menuAdmission RequirementsSJSU RequirementsDegree Program RequirementsTest RequirementsDeadlinesToggle menuDeadlinesDomestic DeadlinesInternational DeadlinesWant to ApplyToggle menuWant to ApplyDomestic Steps to AdmissionToggle menuDomestic Steps to AdmissionGraduate California ResidencyInternational Steps to AdmissionToggle menuInternational Steps to Admission3-year Bachelors DegreeHave AppliedToggle menuHave AppliedActivate MySJSUApplication Document SubmittedConnect With UsStatement of Purpose SubmittedBeen AdmittedToggle menuBeen AdmittedDomestic Steps to EnrollmentInternational Steps to EnrollmentToggle menuInternational Steps to EnrollmentTransferring an I-20Changing Your Academic LevelCampus ResourcesDeferral InformationMandatory Intent to EnrollInternational Financial DocumentsImpactionToggle menuImpactionFreshmen Impaction ResultsToggle menuFreshmen Impaction ResultsFall 2023Fall 2022EI for College of Engineering Programs - FreshmenArchiveToggle menuArchiveFall 2021Spring 2021Fall 2020Fall 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012Transfer Impaction ResultsToggle menuTransfer Impaction ResultsFall 2024Spring 2024Fall 2023Spring 2023Fall 2022Spring 2022ArchiveToggle menuArchiveFall 2021Spring 2021Fall 2020Spring 2020Fall 2019Spring 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012Programs with Supplemental CriteriaToggle menuPrograms with Supplemental CriteriaTransfer Impaction Criteria - Associate Degree forTransfer Impaction Criteria - Program Specific CouSupplemental Application for TransferToggle menuSupplemental Application for TransferSupplemental Application Help GuideAdmission StatusToggle menuAdmission StatusUndergraduate Application StatusGraduate Application StatusToggle menuGraduate Application StatusAppeal ProcessToggle menuAppeal ProcessGraduate Appeal SubmissionUndergraduate AppealToggle menuUndergraduate AppealAppeal SubmittedAppeal SubmittedResidency ResourcesAbout UsToggle menuAbout UsAssessment ReportsUniversity Learning OutcomesSJSU Fall Preview DayToggle menuSJSU Fall Preview DayCollege PresentationsWorkshopsSpartan BookstoreEvent ParkingSpartan Eats DiningVideo Library",
                "Admission RequirementsSJSU RequirementsDegree Program RequirementsTest Requirements",
                "Have AppliedFreshman ApplicantActivate MySJSU",
                "Admission RequirementsCSU Eligibility RequirementsCoursework Outside the U.S.",
                "International Steps to Admission3-year Bachelors Degree",
                "Transfer Impaction ResultsFall 2024Spring 2024Fall 2023Spring 2023Fall 2022Spring 2022ArchiveToggle menuArchiveFall 2021Spring 2021Fall 2020Spring 2020Fall 2019Spring 2019Fall 2018Fall 2017Fall 2016Fall 2015Fall 2014Fall 2013Fall 2012",
                "SJSU on FacebookSJSU on TwitterSJSU on LinkedInSJSU on InstagramSJSU on YouTube",
                "SJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSU",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParent andFamily Programs",
                "Domestic Steps to AdmissionGraduate California Residency",
                "Been AdmittedFreshman Steps to EnrollmentFreshman Intent to EnrollRegister for ClassesFreshman Test RequirementsEarly Start",
                "BusinessEducationEngineeringGraduate StudiesHealth and Human SciencesHumanities and the ArtsProfessional EducationScienceSocial Science",
                "Contact FormDirectoryDoing Business with SJSUEmergency InfoFile a ComplaintReport a Title IX Complaint",
                "Why SJSU?FreshmanAdmissions RequirementsWant to ApplyHave AppliedBeen AdmittedDeadlinesTransferAdmission RequirementsWant to ApplyHave AppliedBeen AdmittedDeadlinesInternational FreshmanAdmission RequirementsWant to ApplyHave AppliedBeen AdmittedDeadlinesInternational TransferAdmission RequirementsWant to ApplyHave AppliedBeen AdmittedDeadlinesGraduateDegree ProgramsAdmission RequirementsDeadlinesWant to ApplyHave AppliedBeen AdmittedInternational Financial DocumentsImpactionFreshmen Impaction ResultsTransfer Impaction ResultsPrograms with Supplemental CriteriaSupplemental Application for TransferAdmission StatusUndergraduate Application StatusGraduate Application StatusUndergraduate AppealResidency ResourcesAbout UsAssessment ReportsUniversity Learning OutcomesSJSU Fall Preview DayCollege PresentationsWorkshopsSpartan BookstoreEvent ParkingSpartan Eats DiningVideo Library",
                "Colleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing Library",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and Institutes",
                "Admission StatusUndergraduate Application StatusGraduate Application StatusToggle menuGraduate Application StatusAppeal ProcessToggle menuAppeal ProcessGraduate Appeal SubmissionUndergraduate AppealToggle menuUndergraduate AppealAppeal SubmittedAppeal SubmittedResidency Resources",
                "Last Updated Oct 1, 2024",
                "Graduate Application StatusAppeal ProcessToggle menuAppeal ProcessGraduate Appeal Submission",
                "International Steps to EnrollmentTransferring an I-20Changing Your Academic Level",
                "Have AppliedTransfer ApplicantActivate MySJSUWriting Skills TestSubmitting Documents",
                "Programs with Supplemental CriteriaTransfer Impaction Criteria - Associate Degree forTransfer Impaction Criteria - Program Specific Cou",
                "PLACEHOLDER-FOR-XSL:VALUE-OF(SITE-TITLE) on FacebookPLACEHOLDER-FOR-XSL:VALUE-OF(SITE-TITLE) on TwitterPLACEHOLDER-FOR-XSL:VALUE-OF(SITE-TITLE) on Instagram",
                "Want to ApplyApply to SJSUTransfer Steps to AdmissionTransfer Success PathwaySupplemental ApplicationAssociate DegreeFormer StudentSuccess ProgramsSpring Admission"
            ],
            "class:j-stack": [],
            "class:galcolumn": []
        },
        "https://www.sjsu.edu/giving/": {
            "ul": [
                "Ways to GiveAreas to SupportImpact of GivingAboutFAQGive Now",
                "Ways to GiveScholarshipsEmployee GivingMake a Stock GiftDonor Bill of Rights",
                "A-Z IndexAnnual Security Report [pdf]BookstoreCalendarsCareers and JobsCatalogCurrent StudentsEmergency Food & HousingFaculty & StaffFreedom of SpeechKing LibraryNewsCenterParenting StudentsParking and Maps",
                "Last Updated Sep 3, 2024",
                "VisitToggle menuCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsToggle menuColleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing LibraryAdmissionsToggle menuTuition and FeesHousingProfessional EducationInternational StudentsParents and Family ProgramsCampus LifeToggle menuHealth and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni ConnectionResearch and InnovationToggle menuOffice of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and InstitutesAthleticsSJSU OnlineAboutToggle menuAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "VisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "One Washington SquareSan José, CA 95192408-924-1000SJSU Online",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnection",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParents and Family Programs",
                "Campus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJ",
                "Impact of Giving",
                "FAQ",
                "Health and WellnessSafetySJSU CaresEventsTraditionsStudent Alumni Connection",
                "Areas to SupportNaming OpportunitiesStudent SuccessSpartan AthleticsLucas College and Graduate School of BusinessCollege of ScienceCollege of Social SciencesCharles W. Davidson College of Engineering1857 CircleCollege of Humanities and the Arts",
                "AccessibilityAccreditationTitle IXDiversityLand AcknowledgementPrivacy",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand Institutes",
                "Administrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefined",
                "MenuVisitCampus ToursMapsParkingSilicon ValleyHammer TheatreSJSU Loves SJAcademicsColleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing LibraryAdmissionsTuition and FeesHousingProfessional EducationInternational StudentsParent andFamily ProgramsCampus LifeHealth and WellnessSafetySJSU CaresEventsTraditionsStudent AlumniConnectionResearch andInnovationOffice of ResearchOffice of InnovationResearch FoundationStudent-FacultyCollaborationsBecome aResearch PartnerCentersand InstitutesAboutAdministrationand LeadershipFacts andAccomplishmentsNewsCenterPartnershipsTransformationDefinedSJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSUSearch×search",
                "AboutFAQ",
                "SJSU on FacebookSJSU on TwitterSJSU on LinkedInSJSU on InstagramSJSU on YouTube",
                "SJSU OnlineAthleticsAlumni AssociationGiving to SJSUCanvasone.SJSU",
                "Tuition and FeesHousingProfessional EducationInternational StudentsParent andFamily Programs",
                "BusinessEducationEngineeringGraduate StudiesHealth and Human SciencesHumanities and the ArtsProfessional EducationScienceSocial Science",
                "Contact FormDirectoryDoing Business with SJSUEmergency InfoFile a ComplaintReport a Title IX Complaint",
                "Colleges and DepartmentsMajors and ProgramsAcademic CalendarClassesKing Library",
                "Office of ResearchOffice of InnovationResearch FoundationStudent-Faculty CollaborationsBecome a Research PartnerCenters and Institutes",
                "Colleges andDepartmentsMajors andProgramsAcademic CalendarClassesKing Library",
                "Ways to GiveToggle menuWays to GiveScholarshipsEmployee GivingMake a Stock GiftDonor Bill of RightsAreas to SupportToggle menuAreas to SupportNaming OpportunitiesStudent SuccessSpartan AthleticsLucas College and Graduate School of BusinessCollege of ScienceCollege of Social SciencesCharles W. Davidson College of Engineering1857 CircleCollege of Humanities and the ArtsImpact of GivingToggle menuImpact of GivingAboutToggle menuAboutFAQGive Now"
            ],
            "class:j-stack": [],
            "class:galcolumn": []
        }
    }
}